---------------------------------------------------------------------------------
             Layer (type)           Output Shape         Param #     Tr. Param # 
=================================================================================
     FirstResidualBlock-1      [1, 32, 480, 640]           9,600           9,600 
              MaxPool2d-2      [1, 32, 240, 320]               0               0 
    PreactResidualBlock-3      [1, 64, 240, 320]          57,536          57,536 
              MaxPool2d-4      [1, 64, 120, 160]               0               0
    PreactResidualBlock-5     [1, 128, 120, 160]         229,760         229,760
              MaxPool2d-6       [1, 128, 60, 80]               0               0
    PreactResidualBlock-7       [1, 256, 60, 80]         918,272         918,272
              MaxPool2d-8       [1, 256, 30, 40]               0               0
    PreactResidualBlock-9       [1, 512, 30, 40]       3,671,552       3,671,552
       ConvTranspose2d-10       [1, 256, 60, 80]         524,544         524,544
   PreactResidualBlock-11       [1, 256, 60, 80]       1,902,080       1,902,080
       ConvTranspose2d-12     [1, 128, 120, 160]         131,200         131,200
   PreactResidualBlock-13     [1, 128, 120, 160]         475,904         475,904
       ConvTranspose2d-14      [1, 64, 240, 320]          32,832          32,832
   PreactResidualBlock-15      [1, 64, 240, 320]         119,168         119,168
       ConvTranspose2d-16      [1, 32, 480, 640]           8,224           8,224
   PreactResidualBlock-17      [1, 32, 480, 640]          29,888          29,888
                Conv2d-18       [1, 3, 480, 640]              99              99
=================================================================================
Total params: 8,110,659
Trainable params: 8,110,659
Non-trainable params: 0
---------------------------------------------------------------------------------